PaymentCreateAllISPC/results/20211007/BMPaymentV19/PAYCTFORDOMOUPSME_Create20211007152435982.txt

Status: UNKNOWN
Time Taken: 1909
Size: 4322
Timestamp: Thu Oct 07 15:24:34 IST 2021
TestStep: Create

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V1_9
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 7363
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v21" xmlns:urn="urn:pins.payment.evry.com:ws:paymentinitiation:v1_9" xmlns:urn1="urn:pins.payment.evry.com:domain:paymentinitiation:v1_9" xmlns:urn2="urn:pins.payment.evry.com:domain:sepa-complex-types:v7" xmlns:urn3="urn:pins.payment.evry.com:domain:debtor:v1_7" xmlns:urn4="urn:pins.payment.evry.com:domain:creditor:v1_7">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>paymentAuthorizationCreate</wsc:Function>
         <wsc:Version>1.0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>55057203187</wsc:userid>
            <wsc:credentials>03111012010400425kbKcJMZoMF56OVtVL1neI9CfuAtjCBO603eS0IgWm1WWIO7EfpSL4DE/lDFi69n1sSaabKNt2t+xJppso23a37EmmmyjbdrfF3M0FKxtlD/HJbEkbc46/BMCstNp869esSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu3EfQIWD5xMfslE2lt0gldZQIyIMvAwCMo=Owe13MJu4QRF5Vj5fdm42aK3nL6InZ7iUXQ2d3QvsDlp4SRrFo03WNE0BwBvlyk3Y5tHWP+DVGwZTtsKKiL4yr1VcsAzMmjub6dAdZ8J2NSTeOl14BcfV4hHDqgvdtQ6wTLSNlDSmdoQHUgDHgLgF/oRUnWDutHal9uw/ZEemPI=</wsc:credentials>
            <wsc:channel>BES</wsc:channel>
            <wsc:orgid>2544</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>2544</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>55057203187</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item key="TppId" value="1"/>
            <wsc:item key="TppName" value="ABC"/>
            <wsc:item key="PaymentChannel" value="BES"/>
            <wsc:item key="LogRef" value="2544bank"/>
            <wsc:item key="AgreementId" value="55057203187"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentCreateRequest>
         <urn:paymentMessage>
            <urn1:paymentIdentification>
               <urn2:messageIdentification>4723835</urn2:messageIdentification>
               <urn2:endToEndIdentification>PAYCTFORDOMOUPSME</urn2:endToEndIdentification>
               <!--Optional:-->
            </urn1:paymentIdentification>
            <urn1:paymentInfo>
               <urn3:paymentMethod>TRF</urn3:paymentMethod>
               <!--Optional:-->
               <urn3:paymentTypeInformation>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn3:instructionPriority>NORM</urn3:instructionPriority>
                  <urn3:categoryPurpose>SUPP</urn3:categoryPurpose>
               </urn3:paymentTypeInformation>
               <urn3:requestedExecutionDate>2021-10-07</urn3:requestedExecutionDate>
               <urn3:debtorAccount>
                  <urn2:identification>36281079039</urn2:identification>
                  <urn2:currency>NOK</urn2:currency>
                  <!--Optional:-->
               </urn3:debtorAccount>
               <!--Optional:-->
               <!--Optional:-->
               <urn3:debtorAgentBIC>SPAVNOBBXXX</urn3:debtorAgentBIC>
               <urn3:debtor>
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn2:name>debt</urn2:name>
                  <urn2:postalAddress>
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <urn2:addressType>ADDR</urn2:addressType>
                     <urn2:department>adfa</urn2:department>
                     <urn2:subDepartment>adfa</urn2:subDepartment>
                     <urn2:streetName>stret</urn2:streetName>
                     <urn2:buildingNumber>123</urn2:buildingNumber>
                     <urn2:postCode>7919</urn2:postCode>
                     <urn2:townName>teewne</urn2:townName>
                     <urn2:country>NO</urn2:country>
                     <!--0 to 7 repetitions:-->
                  </urn2:postalAddress>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
               </urn3:debtor>
               <!--Optional:-->
               <!--Optional:-->
            </urn1:paymentInfo>
            <urn1:transaction>
               <urn4:amount>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <urn2:instructedAmount currency="NOK">
                     <urn2:amount>1</urn2:amount>
                  </urn2:instructedAmount>
               </urn4:amount>
               <!--Optional:-->
               <!--Optional:-->
               <urn4:chargeBearer>SHAR</urn4:chargeBearer>
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <urn4:creditorAgent>
                  <urn2:bic>VEFONO21XXX</urn2:bic>
                  <urn2:postalAddress>
                     <urn2:addressType>ADDR</urn2:addressType>
                     <urn2:postCode>1122</urn2:postCode>
                     <urn2:country>NO</urn2:country>
                  </urn2:postalAddress>
               </urn4:creditorAgent>
               <urn4:creditor>
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn2:name>After name</urn2:name>
                  <urn2:postalAddress>
                     <urn2:addressType>PBOX</urn2:addressType>
                     <urn2:buildingNumber>jjj</urn2:buildingNumber>
                     <urn2:postCode>11</urn2:postCode>
                     <urn2:country>NO</urn2:country>
                  </urn2:postalAddress>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
               </urn4:creditor>
               <!--Optional:-->
               <urn4:creditorAccount>
                  <urn2:identification>24801016517</urn2:identification>
                  <urn2:currency>NOK</urn2:currency>
                  <!--Optional:-->
               </urn4:creditorAccount>
               <!--Optional:-->
               <!--Zero or more repetitions:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Zero or more repetitions:-->
               <!--Optional:-->
            </urn1:transaction>
            <urn1:referredDocumentInformation>
               <urn2:type>CINV</urn2:type>
               <urn2:issuer>check CINV</urn2:issuer>
               <urn2:relatedDate>2021-10-08</urn2:relatedDate>
               <urn2:invoiceeOtherId>2910</urn2:invoiceeOtherId>
            </urn1:referredDocumentInformation>
            <urn1:autoConfirm>true</urn1:autoConfirm>
            <!--Optional:-->
            <!--Optional:-->
         </urn:paymentMessage>
      </urn:PaymentCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 55057203187;2544;55057203187;EVRYCPS;PIN;PINSPayment_V1_9.PaymentCreate;-;2544bank;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns5:PaymentCreateResponse xmlns:ns7="urn:pins.payment.evry.com:domain:nationalinformation-nor:v1_2" xmlns:ns6="urn:pins.payment.evry.com:domain:debtor:v1_7" xmlns:ns5="urn:pins.payment.evry.com:ws:paymentinitiation:v1_9" xmlns:ns4="urn:pins.payment.evry.com:domain:creditor:v1_7" xmlns:ns3="urn:pins.payment.evry.com:domain:sepa-complex-types:v7" xmlns:ns2="urn:pins.payment.evry.com:domain:paymentinitiation:v1_9" xmlns="http://edb.com/ws/WSCommon_v21">
         <ns3:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <StrErrorCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <Message>OK</Message>
            <NativeError xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <errorItem key="6456" value="A similar payment was recently added. Make sure it is not a mistake."/>
         </ns3:ResponseState>
         <ns5:paymentResult>
            <ns2:messageId>1025630</ns2:messageId>
            <ns2:paymentInfoId>1119079</ns2:paymentInfoId>
            <ns2:transactionId>260897045</ns2:transactionId>
            <ns2:initiatorIdentifier>55057203187</ns2:initiatorIdentifier>
            <ns2:paymentReference>260897045</ns2:paymentReference>
            <ns2:releaseDate>2021-10-07+02:00</ns2:releaseDate>
            <ns2:paymentType>FOREIGN_DOMESTIC_MESSAGE_STRUCT</ns2:paymentType>
            <ns2:paymentProduct>PI Domestic</ns2:paymentProduct>
            <ns2:transactionFee currency="NOK">
               <ns3:amount>5.00</ns3:amount>
            </ns2:transactionFee>
            <ns2:additionalServiceCharge>
               <ns3:serviceName>PI Foreign Account</ns3:serviceName>
               <ns3:charge currency="NOK">
                  <ns3:amount>3.00</ns3:amount>
               </ns3:charge>
            </ns2:additionalServiceCharge>
            <ns2:paymentIdentification>
               <ns3:messageIdentification>4723835</ns3:messageIdentification>
               <ns3:endToEndIdentification>PAYCTFORDOMOUPSME</ns3:endToEndIdentification>
            </ns2:paymentIdentification>
            <ns2:groupHeader>
               <ns3:creationDateTime>2021-10-07T11:54:33.975+02:00</ns3:creationDateTime>
            </ns2:groupHeader>
            <ns2:paymentInfo>
               <ns6:paymentMethod>TRF</ns6:paymentMethod>
               <ns6:paymentTypeInformation>
                  <ns6:instructionPriority>NORM</ns6:instructionPriority>
                  <ns6:categoryPurpose>SUPP</ns6:categoryPurpose>
               </ns6:paymentTypeInformation>
               <ns6:requestedExecutionDate>2021-10-07+02:00</ns6:requestedExecutionDate>
               <ns6:debtorAccount>
                  <ns3:identification>36281079039</ns3:identification>
                  <ns3:currency>NOK</ns3:currency>
               </ns6:debtorAccount>
               <ns6:debtorAgentBIC>SPAVNOBBXXX</ns6:debtorAgentBIC>
               <ns6:debtor>
                  <ns3:name>debt</ns3:name>
                  <ns3:postalAddress>
                     <ns3:addressType>ADDR</ns3:addressType>
                     <ns3:department>adfa</ns3:department>
                     <ns3:subDepartment>adfa</ns3:subDepartment>
                     <ns3:streetName>stret</ns3:streetName>
                     <ns3:buildingNumber>123</ns3:buildingNumber>
                     <ns3:postCode>7919</ns3:postCode>
                     <ns3:townName>teewne</ns3:townName>
                     <ns3:country>NO</ns3:country>
                  </ns3:postalAddress>
               </ns6:debtor>
            </ns2:paymentInfo>
            <ns2:transaction>
               <ns4:amount>
                  <ns3:instructedAmount currency="NOK">
                     <ns3:amount>1.00</ns3:amount>
                  </ns3:instructedAmount>
               </ns4:amount>
               <ns4:chargeBearer>SHAR</ns4:chargeBearer>
               <ns4:creditorAgent>
                  <ns3:bic>VEFONO21XXX</ns3:bic>
                  <ns3:nationalId>2544</ns3:nationalId>
                  <ns3:postalAddress>
                     <ns3:addressType>ADDR</ns3:addressType>
                     <ns3:postCode>1122</ns3:postCode>
                     <ns3:country>NO</ns3:country>
                  </ns3:postalAddress>
               </ns4:creditorAgent>
               <ns4:creditor>
                  <ns3:name>After name</ns3:name>
                  <ns3:postalAddress>
                     <ns3:addressType>PBOX</ns3:addressType>
                     <ns3:buildingNumber>jjj</ns3:buildingNumber>
                     <ns3:postCode>11</ns3:postCode>
                     <ns3:country>NO</ns3:country>
                  </ns3:postalAddress>
               </ns4:creditor>
               <ns4:creditorAccount>
                  <ns3:identification>24801016517</ns3:identification>
                  <ns3:currency>NOK</ns3:currency>
               </ns4:creditorAccount>
               <ns4:confidential>false</ns4:confidential>
               <ns4:uetrId>39596f74-c9ce-4e1c-b2d3-ec7226ca5b90</ns4:uetrId>
               <ns2:remittanceInformation>
                  <ns3:remittanceInformationStructured>
                     <ns3:referredDocumentInformation>
                        <ns3:type>CINV</ns3:type>
                        <ns3:issuer>check CINV</ns3:issuer>
                        <ns3:relatedDate>2021-10-08+02:00</ns3:relatedDate>
                        <ns3:invoiceeOtherId>2910</ns3:invoiceeOtherId>
                     </ns3:referredDocumentInformation>
                  </ns3:remittanceInformationStructured>
               </ns2:remittanceInformation>
            </ns2:transaction>
            <ns2:marketType>BM</ns2:marketType>
            <ns2:paymentStatus>TO_BE_APPROVED</ns2:paymentStatus>
         </ns5:paymentResult>
      </ns5:PaymentCreateResponse>
   </soap:Body>
</soap:Envelope>
